IDEA Open Model
TwoWaySlabType Enumeration
Compatible with IDEA StatiCa 20.1
 Two way slab types
 Namespace: IdeaRS.OpenModel.Concrete
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.1.0
Syntax
public enum TwoWaySlabType
Public Enumeration TwoWaySlabType
Members
Member name | Value | Description
Slab | 0 |  slab model - only bending forces + shell
Wall | 1 |  wall model - only membrane forces
DeepBeam | 2 |  wall model - only membrane forces - detailing for deep beam
ShellAsPlate | 3 |  shell model - all forces - detailing for slab
ShellAsWall | 4 |  shell model - all forces - detailing for wall
See Also
Reference
IdeaRS.OpenModel.Concrete Namespace